//------------------------------------------------------------------------------
// tree.cpp - содержит функции обработки деревьев
//------------------------------------------------------------------------------

#include "tree.h"

//------------------------------------------------------------------------------
// Ввод параметров дерева из потока
void In(tree& t, FILE* file) {
    fscanf(file, "%d%s", &t.age, &t.name);
}

//------------------------------------------------------------------------------
// Случайный ввод параметров дерева
void InRnd(tree& t) {
    char* str = RandomStr();
    strcpy(t.name, str);
    t.age = (rand() % 1000) + 1;
}

//------------------------------------------------------------------------------
// Частное от деления количества гласныъ букв имени на количество всех букв
double Quotient(tree& t) {
    char all_gl[12] = { 'A', 'a', 'E', 'e', 'I', 'i', 'O', 'o', 'U', 'u', 'Y', 'y' };
    double gl = 0;
    for (int i = 0; i < strlen(t.name); i++) {
        for (int j = 0; j < strlen(all_gl); j++) {
            if (t.name[i] == all_gl[j]) {
                gl++;
                break;
            }
        }
    }
    return gl / strlen(t.name);
}

//------------------------------------------------------------------------------
// Вывод параметров дерева
void Out(tree& t, FILE* file) {
    fprintf(file, "It is Tree. Age: %d, Name: %s, Quotient of division: %e\n", t.age, &t.name, Quotient(t));
}


